Tekla.Structures.Model.ReferenceModel
The ReferenceModel class contains methods related to reference models.
A reference model is a reference of an external model.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
ReferenceModel ReferenceModel = new ReferenceModel();
ReferenceModel.Filename = "c:\\TeklaStructuresModels\\reference_model.dwg";
ReferenceModel.Scale = 1.0;
bool Result = false;
Result = ReferenceModel.Insert();
}
}

Tekla.Structures.Model.ReferenceModel.filename
The filename.

Tekla.Structures.Model.ReferenceModel.activeFilePath
The active file path.

Tekla.Structures.Model.ReferenceModel.title
The Title

Tekla.Structures.Model.ReferenceModel.position
The position.

Tekla.Structures.Model.ReferenceModel.scale
The scale.

Tekla.Structures.Model.ReferenceModel.visibility
The visibility.

Tekla.Structures.Model.ReferenceModel.basePointGuid
The base point guid.

Tekla.Structures.Model.ReferenceModel.rotation3D
The 3d rotation.

Tekla.Structures.Model.ReferenceModel.projectGuid
The project guid.

Tekla.Structures.Model.ReferenceModel.modelGuid
The model guid.

Tekla.Structures.Model.ReferenceModel.versionGuid
The version guid.

Tekla.Structures.Model.ReferenceModel.Filename
The path to the original location of the reference file.

Tekla.Structures.Model.ReferenceModel.ActiveFilePath
Gets the path to the local copy of the current revision of the reference model.

Tekla.Structures.Model.ReferenceModel.Title
The reference model name(title).

Tekla.Structures.Model.ReferenceModel.Position
The position of the reference model.

Tekla.Structures.Model.ReferenceModel.Scale
The scale of the reference model.

Tekla.Structures.Model.ReferenceModel.Visibility
The visibility of the reference model in the model view.

Tekla.Structures.Model.ReferenceModel.BasePointGuid
The GUID of the used base point. Empty if base point is not used.

Tekla.Structures.Model.ReferenceModel.UseWorkplane
Sets whether workplane is used.
Remarks: Used only for insertsion!

Tekla.Structures.Model.ReferenceModel.Rotation
Gets or sets value of rotation around Z axis (degrees).
Remarks: Reading result is only specified exactly when there are no other rotations. Otherwise it is approximate.
Writing resets the other rotations so that the overall rotation is only around Z axis.

Tekla.Structures.Model.ReferenceModel.Rotation3D
Gets or sets value of 3d rotation.

Tekla.Structures.Model.ReferenceModel.ProjectGUID
The ProjectGUID of the reference model in the Project Center.

Tekla.Structures.Model.ReferenceModel.ModelGUID
The ModelGUID of the reference model in the Project Center.

Tekla.Structures.Model.ReferenceModel.VersionGUID
The VersionGUID of the reference model in the Project Center.

Tekla.Structures.Model.ReferenceModel.#ctor
Initializes a new instance of the Tekla.Structures.Model.ReferenceModel class.
The default values are as follows:
Filename = string.Empty;
ActiveFilePath = string.Empty;
ProjectGUID = Guid.Empty;
ModelGUID = Guid.Empty;
VersionGUID = Guid.Empty;
Position = new Point();
Scale = 1.0;
Visibility = VisibilityEnum.VISIBLE;
BasePointGuid = string.Empty;

Tekla.Structures.Model.ReferenceModel.#ctor(System.String,Tekla.Structures.Geometry3d.Point,System.Double)
Initializes a new instance of the Tekla.Structures.Model.ReferenceModel class.
Creates a new reference model instance using the given filename, position and scale.
filename:
The filename to be used.
position:
The position to be used.
scale:
The scale to be used.

Tekla.Structures.Model.ReferenceModel.GetConvertedObjects
Returns an enumerator of model object converted from the reference model.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.ReferenceModel.RefreshFile
Reload the reference file from the location specified by Filename.
If the file has changed, a new revision will be created and taken into use.
Note that if a new revision was successfully created, the ActiveFilePath is changed.
Returns:
true if a new revision was added, false if it was not.
If false, the file can either be unchanged or there was an error.

Tekla.Structures.Model.ReferenceModel.GetRevisions
Gets the reference models available revisions.
Returns:

Tekla.Structures.Model.ReferenceModel.GetReferenceModelObjectByExternalGuid(System.String)
Gets reference model object by external (IFC) guid from this reference model.
externalGuid: External (IFC) Guid of the reference object.
Returns: Reference model object with specified external guid.

Tekla.Structures.Model.ReferenceModel.GetReferenceModelObjectGuidsByExternalGuids(System.Collections.Generic.List{System.String})
Gets reference model object guids by external guids.
externalGuids: The external guids.
Returns: If successful, the reference model object guids.

Tekla.Structures.Model.ReferenceModel.SetAsCurrentRevision(Tekla.Structures.Model.ReferenceModel.Revision)
Sets the given revision as current revision.
revision: The revision to be set as current.
Returns:

Tekla.Structures.Model.ReferenceModel.SetAsCurrentRevision(System.Int32,System.Int32)
Sets the given revision as current revision.
modelId: The model id, which revision is to be changed.
revisionId: The revision to be set as current.
Returns:

Tekla.Structures.Model.ReferenceModel.GetCurrentRevision
Gets the current revision.
Returns:

Tekla.Structures.Model.ReferenceModel.RemoveRevision(Tekla.Structures.Model.ReferenceModel.Revision)
Removes the given revision from the reference model.
revision: The reference model revision to be removed.
Returns:
True if removed successfully, otherwise false.

Tekla.Structures.Model.ReferenceModel.Insert
Inserts the reference model into the model.
Returns: True on success.

Tekla.Structures.Model.ReferenceModel.Select
Selects the reference model with the given identifier.
Returns: True on success.

Tekla.Structures.Model.ReferenceModel.Modify
Modifies the reference model with the given identifier.
Returns: True on success.

Tekla.Structures.Model.ReferenceModel.Delete
Deletes the reference model with the given identifier.
Returns: True on success.

Tekla.Structures.Model.ReferenceModel.GetChildren
Returns an enumerator of all the children reference model objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.ReferenceModel.FileExists
Checks if the reference model file exists.
Returns: True if exists, otherwise false.

Tekla.Structures.Model.ReferenceModel.FileExistsUnderModelFolder(System.String)
Checks if the given relative file path exists under model folder. Needed, because
current path is not always model folder when running external applications.
relativeFilePath: The relative file path.
Returns: True if exists, otherwise false.

Tekla.Structures.Model.ReferenceModel.CreateInstance
Create this reference model in the currently active Tekla Structures model.
Returns:
true on success, false otherwise.

Tekla.Structures.Model.ReferenceModel.SelectInstance
Select the reference model from Tekla Structures.
Returns:
true on success, false otherwise.

Tekla.Structures.Model.ReferenceModel.ModifyInstance
Modify this reference model in Tekla Structures.
Returns:
true on success, false otherwise.

Tekla.Structures.Model.ReferenceModel.ValidateFilePath
Special characters are not supported. Checks that the current file name does not contain non-supported characters.
Returns: True if valid.

Tekla.Structures.Model.ReferenceModel.ToStruct(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
Serialize this object to struct.
P:
The target struct.

Tekla.Structures.Model.ReferenceModel.FromStruct(Tekla.Structures.ModelInternal.dotReferenceModel_t@)
Deserialize from given struct to this object.
P:
The source struct.